# CreateFolder

## Description
Creates a folder on the hard drive.

```pascal
FUNCTION CreateFolder(path : DYNARRAY[] of CHAR) : BOOLEAN;
```

```python

def vs.CreateFolder(path):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|path|DYNARRAY[] of CHAR||

## Version
Availability: from Vectorworks 2014
## Category
* File I/O